# Написати функцiю season, яка приймає один аргумент (номер мiсяця вiд 1 до 12) та яка буде повертати пору року, якiй
# цей мiсяць належить (зима, весна, лiто або осiнь). У випадку некоректного введеного значення - виводити відповідне
# повідомлення.

def season(month):
    if month in ["1", "2", "12"]:
        result = "зима"
    elif month in ["3", "4", "5"]:
        result = "весна"
    elif month in ["6", "7", "8"]:
        result = "літо"
    elif month in ["9", "10", "11"]:
        result = "осінь"
    else:
        result = "некоректно введені дані"
    return result


month_number = input("Введіть номер місяця, щоб дізнатися пору року: ")
print(f"Введена пора року - {season(month_number)}")
